app/controllers/homes_controller.rb

    def index
        @places = Place.all
        categories = get_categories
        @places.each do |place|
---
SELECT `places`.* FROM `places`