app/controllers/plans_controller.rb

    def index
        @plans = Plan.where(planner_id: 1).order(start_time: :asc)
        @plans_with_place_info = []
        @plans.each do |plan|
          place_id = plan.place_id
          place_info = Place.select(:title, :image, :description, :location, :source_link, :open_time, :close_time)
                            .find_by(id: place_id)
          if place_info
            plan_with_place_info = plan.attributes.merge(place_info.attributes)
            plan_with_place_info['id'] = plan.id
            @plans_with_place_info << plan_with_place_info
---
SELECT `plans`.* FROM `plans` WHERE `plans`.`planner_id` = 1 ORDER BY `plans`.`start_time` ASC
SELECT `places`.`title`, `places`.`image`, `places`.`description`, `places`.`location`, `places`.`source_link`, `places`.`open_time`, `places`.`close_time` FROM `places` WHERE `places`.`id` = 4 LIMIT 1
INSERT INTO `plans` (`planner_id`, `place_id`, `start_time`, `end_time`, `created_at`, `updated_at`) VALUES (1, 4, '2024-04-15 12:00:00', '2024-04-15 15:00:00', '2024-04-15 02:07:23.350280', '2024-04-15 02:07:23.350280')

    def create
        place_id = plan_params[:place_id]
        start_time = plan_params[:start_time]
        end_time = plan_params[:end_time]

        place = Place.find(place_id)
        if !within_opening_hours?(place, start_time, end_time)
          render json: { error: "The plan time does not fall within the opening hours of the place" }, status: 200
          return
        end

        if same_place_id_and_plan_id?(plan_params[:place_id], plan_params[:planner_id])
          render json: { error: "Place already exists in the planner" }, status: 200
          return
        end

        if overlapping_plans_exist?(start_time, end_time)
          render json: { error: "There are overlapping plans in the given time range" }, status: 200
          return
        end

        plan = Plan.create(plan_params)
---
SELECT `places`.* FROM `places` WHERE `places`.`id` = 25 LIMIT 1
INSERT INTO `plans` (`planner_id`, `place_id`, `start_time`, `end_time`, `created_at`, `updated_at`) VALUES (1, 25, '2024-04-14 09:00:00', '2024-04-14 10:00:00', '2024-04-15 03:55:40.143853', '2024-04-15 03:55:40.143853')

    def destroy
        @plan = Plan.find(params[:id])
        @plan.destroy
---
SELECT `plans`.* FROM `plans` WHERE `plans`.`id` = 1 LIMIT 1
DELETE FROM `plans` WHERE `plans`.`id` = 1

    def overlapping_plans_exist?(start_time, end_time)
        Plan.exists?(['(start_time < ? AND end_time > ?) OR (start_time < ? AND end_time > ?) OR (start_time >= ? AND end_time <= ?)',
                      end_time, start_time,
                      start_time, end_time,
                      start_time, end_time])
---
SELECT 1 AS one FROM `plans` WHERE ((start_time < '2024-04-14 10:00:00.000' AND end_time > '2024-04-14 09:00:00.000') OR (start_time < '2024-04-14 09:00:00.000' AND end_time > '2024-04-14 10:00:00.000') OR (start_time >= '2024-04-14 09:00:00.000' AND end_time <= '2024-04-14 10:00:00.000')) LIMIT 1

    def same_place_id_and_plan_id?(place_id, planner_id)
        Plan.exists?(place_id: place_id, planner_id: planner_id)
---
SELECT 1 AS one FROM `plans` WHERE `plans`.`place_id` = 25 AND `plans`.`planner_id` = 1 LIMIT 1